---
kind: other
id: Methods.T:Autodesk.Revit.DB.NumberSystem
source: html/15b94df9-9be1-b04e-d9f8-ca42a1b80180.htm
---
# NumberSystem Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.